Repository: mdhrepos/multicurr
Catalog: languages/woocommerce-multicurrency-*.po
Languages: ru_ru

source: WooCommerce Multi-currency
ru_ru: Мультивалютность для WooCommerce

source: %1$s is incompatible with %2$s.
ru_ru: Плагин %1$s не совместим с %2$s.

source: Multi-currency
ru_ru: Мультивалютность

source: To override the automatic price conversion for this product, put the fixed price values in the fields below.
ru_ru: Вы можете игнорировать курсы валют для этого товара и ввести цены в каждой валюте вручную.

source: Multi-currency options
ru_ru: Настройки мультивалютности

source: Note: this will only change the currency, not the amounts!
ru_ru: Внимание: изменится только код валюты. Сумма к оплате не изменится!

source: %1$s requires %2$s version 3+ to be installed and active.
ru_ru: Для работы %1$s необходимо установить и активировать %2$s версии 3+.

source: The %s extension is active. Please configure its settings.
ru_ru: Расширение %s активно. Пожалуйста, настройте его параметры.

source: Documentation
ru_ru: Документация

source: Reset Multi-currency settings
ru_ru: Сброс настроек мультивалютности

source: Reset
ru_ru: Сбросить

source: This tool will reset all Multi-currency settings to default. This action cannot be reversed.
ru_ru: Все настройки мультивалютности будут сброшены. Не забудьте сделать резервное копирование.

source: Export Multi-currency settings
ru_ru: Экспорт настроек мультивалютности

source: Export
ru_ru: Экспортировать

source: This tool will export all Multi-currency settings to a file.
ru_ru: Этот инструмент будет экспортировать все мультивалютные настройки в файл.

source: Import Multi-currency settings
ru_ru: Импорт настроек мультивалютности

source: Import
ru_ru: Импортировать

source: This tool will import all Multi-currency settings from the previously exported file. This action cannot be reversed.
ru_ru: Этот инструмент будет импортировать все мультивалютные настройки из ранее экспортированного файла. Внимание: откатка не возможна.

source: Multi-currency settings have been reset. Number of records deleted: %d.
ru_ru: Настройки мультивалютности были сброшены. Количество записей, удаленных из базы данных: %d.

source: There was an error resetting Multi-currency (or it was already reset).
ru_ru: Произошла ошибка сброса настроек мультивалютности, или настройки уже сброшены.

source: There was an error exporting Multi-currency settings (or they were reset).
ru_ru: Произошла ошибка экспорта мультивалютных настроек (или они были сброшены).

source: Settings exported to
ru_ru: Настройки сохранены в

source: There was an error importing Multi-currency settings.
ru_ru: Произошла ошибка импорта мультивалютных настроек.

source: Settings imported
ru_ru: Настройки импортированы

# Widget
source: Currency
ru_ru: Валюта

# Widget
source: Drop-down currency selector.
ru_ru: Выпадающее меню выбора валюты.

# Widget
source: Currency Selector
ru_ru: Выбор валюты

# Widget
source: Display format:
ru_ru: Формат списка валют:

# Widget
source: Example:
ru_ru: Пример:

# Widget
source: Show flag
ru_ru: Показывать флаги

source: Note: saving changes clears the WP Rocket file cache.
ru_ru: Внимание: при сохранении настроек будет очищен кэш WP Rocket.

source: The commission is calculated in: %1$s (%2$s).
ru_ru: Комиссионные посчитаны в %1$s (%2$s).

source: The order was paid in %1$s (%2$s).
ru_ru: Заказ был оплачен в %1$s (%2$s).

source: The currency exchange rate was: %f.
ru_ru: Обменный курс был: %f.

source: This page totals:
ru_ru: Итого на этой странице:

source: Store Currency
ru_ru: Валюта магазина

source: Rate
ru_ru: Курс

source: Thank you for installing the multi-currency extension! We appreciate your business!
ru_ru: Благодарим вас за установку расширения!

source: Please configure the settings using the instructions below. Should you need help, please contact our technical support by clicking %1$shere%2$s.
ru_ru: Пожалуйста, настройте параметры, следуя приведенным ниже инструкциям. Если вам нужна помощь, пожалуйста, свяжитесь с нашей службой технической поддержки, нажав %1$sздесь%2$s.

source: Allow custom product pricing for extra currencies
ru_ru: Разрешить индивидуальные цены продуктов для дополнительных валют

source: If checked, you can enter product prices for each currency.
ru_ru: Если установлен этот флажок, вы можете ввести цены на товары для каждой валюты.

source: (Simple and variable products only)
ru_ru: (Только простые и вариативные товары)

source: Client-side cookies only
ru_ru: Устанавливать cookies только на фронтенде

source: Do not enable this unless asked by Support. Does not work with some page caching plugins!
ru_ru: Не включайте, если вас не попросила служба поддержки. Эта опция может привести к некорректной работе при наличии некоторых систем кэширования!

source: View logs
ru_ru: Просмотр журнала сообщений

source: Log level
ru_ru: Уровень детализации сообщений в журнале

source: What to write to the log file.
ru_ru: Какие сообщения нужно записывать в журнал.

source: Nothing
ru_ru: Ничего

source: Error conditions
ru_ru: Сообщения об ошибках

source: Informational messages
ru_ru: Информационные сообщения

source: Debug-level messages
ru_ru: Сообщения уровня отладки

source: Debug with tracing
ru_ru: Уровень отладки с трассировкой

source: Currency Exchange Rates
ru_ru: Курсы валют

source: To switch between currencies, your website needs to get the exchange rates from one of the service providers.
ru_ru: Для работы в мультивалютном режиме необходимо получать информацию о курсах валют от одного из провайдеров.

source: Alternatively, you can select the FixedRates option and enter the rates manually.
ru_ru: Или выберите опцию FixedRates и введите курсы валют вручную.

source: Please read the instructions %1$shere%2$s.
ru_ru: Прочтите инструкции %1$sздесь%2$s.

source: Service Provider
ru_ru: Провайдер

source: Please choose one.
ru_ru: Пожалуйста, выберите из списка.

source: Rates update schedule
ru_ru: Частота обновления курсов валют

source: Not applicable to FixedRates
ru_ru: Не используется с опцией FixedRates

source: Currency exchange rates were not retrieved. Additional information may be available in the log.
ru_ru: Курсы валют не были получены. Дополнительная информация может быть доступна в журнале.

source: Enabled currencies
ru_ru: Доступные валюты

source: Please specify all currencies you plan to use.
ru_ru: Пожалуйста, укажите все валюты, которые вы планируете использовать.

source: Then please click the [%s] button at the bottom to continue.
ru_ru: Для продолжения нажмите кнопку [%s] внизу страницы.

source: Currencies
ru_ru: Валюты

source: Select all currencies that will be available on your website.
ru_ru: Выберите все валюты, которые будут доступны на вашем сайте.

source: Select currencies
ru_ru: Выберите валюты

source: Link currency to language
ru_ru: Привязка валюты к языку

source: If you would like to set the currency <strong>automatically</strong> when the language is switched, please set the "Language - Currency" pairs below.
ru_ru: Если вы хотите устанавливать валюту <strong>автоматически</strong> при переключении языка, пожалуйста, установите пары "Язык - Валюта".

source: Note: our Currency Selector Widget can be used for the <strong>manual</strong> currency switching, independently of the language. In that case, the below settings will be ignored.
ru_ru: Внимание: наш Виджет Выбора Валюты может быть использован для <strong>ручной</strong> установки валюты пользователем, независимо от языка и страны. В этом случае нижеуказанные настройки будут игнорированы.

source: Not linked
ru_ru: Не привязан

source: Currency to use when the language is switched to %s.
ru_ru: Валюта, которую нужно установить при переключении языка на %s.

source: Price formats
ru_ru: Форматы представления цен

source: Here you can change the way the prices are displayed, separately for each currency.
ru_ru: Здесь вы можете изменить формат отображения цены - отдельно для каждой валюты.

source: The default format is <code>%s</code>
ru_ru: Формат по умолчанию: <code>%s</code>

source: The <code>%1$s</code> is the placeholder for the currency symbol. <code>%2$s</code> - for the amount.
ru_ru: <code>%1$s</code> заменяется на символ валюты. <code>%2$s</code> - на сумму.

source: For example, if you want the currency symbol to go after the amount, you can use the <code>%2$s%1$s</code> format.
ru_ru: Например, если вы хотите показывать символ валюты после суммы, можно использовать формат <code>%2$s%1$s</code>.

source: %s price format
ru_ru: Формат цены для %s

# Settings placeholder
source: Default
ru_ru: По умолчанию

source: Currency Symbols
ru_ru: Символы валют

source: Change the currency symbol. Enter, for example, <code>C$</code> for Canadian Dollars.
ru_ru: Замените символ валюты. Например, <code>C$</code> для обозначения канадских долларов.

source: %s symbol
ru_ru: Символ для %s

source: Fixed Rates
ru_ru: Фиксированные курсы валют

source: Enter the exchange rate of each currency relative to the US Dollar.
ru_ru: Введите курсы валют относительно доллара США.

source: Price Conversion Settings
ru_ru: Настройки пересчета цен

source: Fine-tune the prices after currency conversion.
ru_ru: Установите параметры округления цен после пересчета по курсу.

source: Example
ru_ru: Пример

source: product price
ru_ru: цена товара

source: price after conversion
ru_ru: цена после пересчета

source: change the values below to recalculate
ru_ru: измените значения в полях чтобы пересчитать

source: Add a conversion fee (%)
ru_ru: Добавить наценку на курс (%)

source: Enter 2.5 to increase the converted price by 2.5%
ru_ru: Введите 2.5 чтобы увеличить сумму после пересчета на 2.5%

source: Round up to
ru_ru: Округлить вверх до

source: Enter 10 to round 123.45 to 130
ru_ru: Введите 10 чтобы округлить 123.45 до 130

source: Price charm
ru_ru: Психология цен

source: Enter 0.01 to show 50 as 49.99
ru_ru: Введите 0.01 чтобы показывать 49.99 вместо 50

source: Saving changes is not permitted.
ru_ru: Сохранение изменений не разрешено.

source: To use this option, you need to install and activate one of the supported multilingual plugins:
ru_ru: Чтобы использовать эту возможность, установите и активируйте один из поддерживаемых мультиязычных плагинов:

# Settings tab title
source: Multi-currency
ru_ru: Мультивалютность

source: Preferred Currency
ru_ru: Валюта по умолчанию

source: Currency to set active upon login
ru_ru: Валюта, которая будет активна при входе в систему

source: Multi-currency support for WooCommerce
ru_ru: Подержка нескольких валют для WooCommerce

source: Provides support for multiple currencies in WooCommerce store by making different cache snapshots for different currencies.
ru_ru: Обеспечивает поддержку мультивалютности в WooCommerce, кэшируя различные версии страниц для разных валют.
